validation/conventional/hysingBenchmark/RANS/2D/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.water.*"
    {
        nAlphaCorr				1;
        nAlphaSubCycles			1;
		cAlpha					1;

		alphaApplyPrevCorr		yes;

        MULESCorr				yes;
        nLimiterIter			3;

        solver					smoothSolver;
        smoother				symGaussSeidel;
        tolerance				1e-10;
        relTol					0;
		minIter					1;
    }

    pcorr
    {
		solver					GAMG;
		smoother				DIC;
        tolerance       		1e-08;
        relTol          		0;
    }

    pcorrFinal
    {
        $pcorr;
        relTol          		0;
    }

    p_rgh
    {
        solver					GAMG;
		smoother				DIC;
        tolerance       		1e-08;
        relTol          		0.01;
		minIter					1;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          		0;
    }

    U
    {
        solver          		smoothSolver;
        smoother        		symGaussSeidel;
        tolerance       		1e-08;
        relTol          		0;
		minIter					1;
    }

    UFinal
    {
        $U;
        relTol          		0;
    }
}

PIMPLE
{
    momentumPredictor			yes;
    nOuterCorrectors			1;
    nCorrectors					3;
    nNonOrthogonalCorrectors	0;
    pRefCell					0;
    pRefValue					0;
}

relaxationFactors
{
    fields
    {
        ".*"					1.0;
    }
    equations
    {
        ".*"					1.0;
    }
}

// ************************************************************************* //
